---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceFacetNumber
source: html/73a1847b-6090-cab9-df11-42653f3bf77c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceFacetNumber Property

"Facet number"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceFacetNumber { get; }
```